Project/Toir/src/Documents/торо_УчетНаработкиОборудования/торо_УчетНаработкиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УчетНаработкиОборудования</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <basedOn>Document.торо_АктОВыполненииЭтапаРабот</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>AccumulationRegister.торо_НаработкаОбъектовРемонта</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыНаработкиОР</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СбросНаработки</name>
    <type>
      <types>DocumentRef.торо_УстановкаПроизвольногоЗначенияНаработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаработкаОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыС</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СтароеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаСНачалаЭксплуатации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаСНачалаЭксплуатацииНачало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
    <attributes>
      <name>РаспространятьНаПодчиненных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаработкаПодчиненныхОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыС</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СтароеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаСНачалаЭксплуатации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаСНачалаЭксплуатацииНачало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РодительИерархии</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_МаксимальныеЗначенияНаработкиОР/торо_МаксимальныеЗначенияНаработкиОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МаксимальныеЗначенияНаработкиОР</name>
  <resources>
    <name>МаксимальноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НазначенныйРесурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/AccumulationRegisters/торо_НаработкаОбъектовРемонта/торо_НаработкаОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_НаработкаОбъектовРемонта</name>
  <resources>
    <name>Наработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/торо_ПериодыНаработкиОР/торо_ПериодыНаработкиОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПериодыНаработкиОР</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/торо_УстановкаПроизвольногоЗначенияНаработки/торо_УстановкаПроизвольногоЗначенияНаработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УстановкаПроизвольногоЗначенияНаработки</name>
  <registerRecords>AccumulationRegister.торо_НаработкаОбъектовРемонта</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыНаработкиОР</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_УчетНаработкиОборудования</types>
      <types>DocumentRef.торо_УстановкаПроизвольногоЗначенияНаработки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаработкаОбъектов</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗафиксированнаяНаработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаДоОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АбсолютнаяНаработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаПослеОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаИзмененияНаработки</name>
      <type>
        <types>CatalogRef.торо_ПричиныИзмененияНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>РаспространятьНаПодчиненных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнейНаработки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаработкаПодчиненныхОбъектов</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗафиксированнаяНаработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаДоОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АбсолютнаяНаработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаПослеОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаИзмененияНаработки</name>
      <type>
        <types>CatalogRef.торо_ПричиныИзмененияНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>РодительИерархии</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнейНаработки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Documents/торо_УчетНаработкиОборудования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

Перем мТаблицаСбросаСчетчика Экспорт; // Хранит таблицу значений, используется для работы с документом торо_УстановкаПроизвольногоЗначенияНаработки. 
перем СтруктураДанных Экспорт; // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьЦельностьНаработкиПриОтменеПроведения(Отказ);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Строка Из НаработкаОбъектов Цикл
		
		Если ЗначениеЗаполнено(Строка.ДатаРаботыПо) И Строка.ДатаРаботыС > Строка.ДатаРаботыПо Тогда
			ШаблонСообщения = НСтр("es='La línea %1: el Significado ""la Fecha del trabajo Por"" debe ser más que ""la Fecha del trabajo Con""';ru='Строка %1: Значение ""Дата работы По"" должно быть больше чем ""Дата работы С""';en='Line%1: The value ""Work Date By"" must be greater than ""Work Date C""'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		ИначеЕсли Строка.Наработка <= 0 Тогда
			ШаблонСообщения = НСтр("es='La línea %1: el Significado de la Elaboración debe ser más de cero';ru='Строка %1: Значение Наработки должно быть больше нуля';en='Line%1: Operating time value must be greater than zero'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения".
// Проводит проведение по "торо_НаработкаОбъектовРемонта".
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверитьЦельностьНаработкиПриПроведении(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	мТаблицаСбросаСчетчика = Новый ТаблицаЗначений;
	мТаблицаСбросаСчетчика.Колонки.Добавить("ОбъектРемонта");
	мТаблицаСбросаСчетчика.Колонки.Добавить("Показатель");
	мТаблицаСбросаСчетчика.Колонки.Добавить("ДатаРаботыПо");
	мТаблицаСбросаСчетчика.Колонки.Добавить("КоличествоСбросовСчетчика");
	мТаблицаСбросаСчетчика.Колонки.Добавить("НовоеЗначениеАбсолютное");
	мТаблицаСбросаСчетчика.Колонки.Добавить("Наработка");
	мТаблицаСбросаСчетчика.Колонки.Добавить("НовоеЗначение");
	мТаблицаСбросаСчетчика.Колонки.Добавить("РодительИерархии");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(торо_МаксимальныеЗначенияНаработкиОР.МаксимальноеЗначение, 0) КАК МаксимальноеЗначение,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.ДатаРаботыПо,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.НовоеЗначение,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.СтароеЗначение,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Наработка
	|ИЗ
	|	Документ.торо_УчетНаработкиОборудования.НаработкаОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
	|		ПО торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект = торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта
	|			И торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель = торо_МаксимальныеЗначенияНаработкиОР.Показатель
	|ГДЕ
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(торо_МаксимальныеЗначенияНаработкиОР.МаксимальноеЗначение, 0),
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.ДатаРаботыПо,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.НовоеЗначение,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.СтароеЗначение,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Наработка
	|ИЗ
	|	Документ.торо_УчетНаработкиОборудования.НаработкаПодчиненныхОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
	|		ПО торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект = торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта
	|			И торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель = торо_МаксимальныеЗначенияНаработкиОР.Показатель
	|ГДЕ
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.МаксимальноеЗначение <> 0 И Выборка.СтароеЗначение + Выборка.Наработка > Выборка.МаксимальноеЗначение Тогда
			КоличествоСбросовСчетчика = Цел((Выборка.СтароеЗначение + Выборка.Наработка) / Выборка.МаксимальноеЗначение);
			НовоеЗначениеАбсолютное = Выборка.СтароеЗначение + Выборка.Наработка;
			
			НС = мТаблицаСбросаСчетчика.Добавить();
			НС.ОбъектРемонта = Выборка.Объект;
			НС.Показатель = Выборка.Показатель;
			НС.ДатаРаботыПо = Выборка.ДатаРаботыПо;
			НС.КоличествоСбросовСчетчика = КоличествоСбросовСчетчика;
			НС.НовоеЗначениеАбсолютное = НовоеЗначениеАбсолютное;
			НС.Наработка = Выборка.Наработка;
			НС.НовоеЗначение = Выборка.НовоеЗначение;
			
		КонецЕсли;
	КонецЦикла;
	
	Если мТаблицаСбросаСчетчика.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_УстановкаПроизвольногоЗначенияНаработки.Ссылка
		|ИЗ
		|	Документ.торо_УстановкаПроизвольногоЗначенияНаработки КАК торо_УстановкаПроизвольногоЗначенияНаработки
		|ГДЕ
		|	торо_УстановкаПроизвольногоЗначенияНаработки.ДокументОснование = &ДокументОснование
		|	И торо_УстановкаПроизвольногоЗначенияНаработки.Проведен";
		
		Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда		
			Попытка
				
				ДокСбросНаработки = Документы.торо_УстановкаПроизвольногоЗначенияНаработки.СоздатьДокумент();
				ДокСбросНаработки.Дата = ТекущаяДата();
				ДокСбросНаработки.Организация = Организация;
				ДокСбросНаработки.Подразделение = Подразделение;
				ДокСбросНаработки.Ответственный = Ответственный;
				ДокСбросНаработки.ДокументОснование = Ссылка;
				
				Для каждого СтрокаТаблицы Из мТаблицаСбросаСчетчика Цикл
					НС = ДокСбросНаработки.НаработкаОбъектов.Добавить();
					НС.ОбъектРемонта = СтрокаТаблицы.ОбъектРемонта;
					НС.Показатель = СтрокаТаблицы.Показатель;
					НС.ДатаПоследнейНаработки = СтрокаТаблицы.ДатаРаботыПо;
					НС.ЗафиксированнаяНаработка = СтрокаТаблицы.НовоеЗначениеАбсолютное;
					НС.ДатаИВремяОперации = СтрокаТаблицы.ДатаРаботыПо;
					НС.НаработкаДоОперации = СтрокаТаблицы.НовоеЗначениеАбсолютное;
					НС.Наработка = 0;
					НС.АбсолютнаяНаработка = торо_РаботаСНаработкой.АбсолютноеЗначениеНаработки(Ссылка, НС.ОбъектРемонта,НС.Показатель) + СтрокаТаблицы.Наработка; 
					НС.НаработкаПослеОперации = СтрокаТаблицы.НовоеЗначение;
					НС.ПричинаИзмененияНаработки = Справочники.торо_ПричиныИзмененияНаработки.ПревышениеРазрядностиПрибораУчета;
				КонецЦикла;
				
				ДокСбросНаработки.Записать(РежимЗаписиДокумента.Проведение);
				
				ШаблонСообщения = НСтр("es='Es formado el documento %1 en relación al exceso разрядности de los aparatos del recuento.';ru='Сформирован документ %1 в связи с превышением разрядности приборов учета.';en='The document%1 was formed due to the excess capacity of metering devices.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ДокСбросНаработки.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Исключение
				ТекстСообщения = НСтр("es='La realización es anulada, puesto que no consiguió pasar el documento ""la Instalación del significado cualquiera de la elaboración"", que arroja las indicaciones del contador.';ru='Проведение отменено, так как не удалось провести документ ""Установка произвольного значения наработки"", сбрасывающий показания счетчика.';en='Posting was canceled, because the document ""Setting an arbitrary value of the operating time"", resetting the counter, was not possible.'");
				ОбщегоНазначения.СообщитьПользователю(ИнформацияОбОшибке().Причина);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;	
	
	Если Не Отказ Тогда
		
		Для Каждого ТекСтрокаНаработкаОбъектов Из НаработкаОбъектов Цикл
			
			ДвижениеПриход = Движения.торо_НаработкаОбъектовРемонта.Добавить();
            ДвижениеПриход.ВидДвижения   = ВидДвиженияНакопления.Приход;
            ДвижениеПриход.Период        = ТекСтрокаНаработкаОбъектов.ДатаРаботыПо;
            ДвижениеПриход.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.Объект;
            ДвижениеПриход.Показатель    = ТекСтрокаНаработкаОбъектов.Показатель;
            ДвижениеПриход.Наработка     = ТекСтрокаНаработкаОбъектов.Наработка;
            ДвижениеПриход.ДатаКон       = ТекСтрокаНаработкаОбъектов.ДатаРаботыПо;
            ДвижениеПриход.ДатаНач       = ТекСтрокаНаработкаОбъектов.ДатаРаботыС;
				
				
			Движение = Движения.торо_ПериодыНаработкиОР.Добавить();
				Движение.Период = ТекСтрокаНаработкаОбъектов.ДатаРаботыПо;
				Движение.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.Объект;
				Движение.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;
		КонецЦикла;
		
		Для Каждого ТекСтрокаНаработкаОбъектов Из НаработкаПодчиненныхОбъектов Цикл
			
			ДвижениеПриход = Движения.торо_НаработкаОбъектовРемонта.Добавить();
            ДвижениеПриход.ВидДвижения   = ВидДвиженияНакопления.Приход;
            ДвижениеПриход.Период        = ТекСтрокаНаработкаОбъектов.ДатаРаботыПо;
            ДвижениеПриход.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.Объект;
            ДвижениеПриход.Показатель    = ТекСтрокаНаработкаОбъектов.Показатель;
            ДвижениеПриход.Наработка     = ТекСтрокаНаработкаОбъектов.Наработка;
            ДвижениеПриход.ДатаКон       = ТекСтрокаНаработкаОбъектов.ДатаРаботыПо;
            ДвижениеПриход.ДатаНач       = ТекСтрокаНаработкаОбъектов.ДатаРаботыС;
				
			Движение = Движения.торо_ПериодыНаработкиОР.Добавить();
				Движение.Период = ТекСтрокаНаработкаОбъектов.ДатаРаботыПо;
				Движение.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.Объект;
				Движение.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Объект КАК Объект,
	|	ТаблицаДокумента.Показатель КАК Показатель,
	|	ТаблицаДокумента.Наработка КАК Наработка,
	|	ТаблицаДокумента.РаспространятьНаПодчиненных КАК РаспространятьНаПодчиненных,
	|	ТаблицаДокумента.Иерархия КАК Иерархия,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_НаработкаОбъектовРемонтаОстатки.ОбъектРемонта КАК Объект,
	|	торо_НаработкаОбъектовРемонтаОстатки.Показатель КАК Показатель,
	|	торо_НаработкаОбъектовРемонтаОстатки.НаработкаОстаток КАК СтароеЗначение
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.торо_НаработкаОбъектовРемонта.Остатки(
	|			&Дата,
	|			(ОбъектРемонта, Показатель) В
	|				(ВЫБРАТЬ
	|					ТаблицаДокумента.Объект,
	|					ТаблицаДокумента.Показатель
	|				ИЗ
	|					ТаблицаДокумента КАК ТаблицаДокумента)) КАК торо_НаработкаОбъектовРемонтаОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПериодыНаработкиОРСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ПериодыНаработкиОРСрезПоследних.Показатель КАК Показатель,
	|	торо_ПериодыНаработкиОРСрезПоследних.Период КАК ДатаРаботыС
	|ПОМЕСТИТЬ ВТ_Даты
	|ИЗ
	|	РегистрСведений.торо_ПериодыНаработкиОР.СрезПоследних(
	|			&Дата,
	|			(ОбъектРемонта, Показатель) В
	|				(ВЫБРАТЬ
	|					ТаблицаДокумента.Объект,
	|					ТаблицаДокумента.Показатель
	|				ИЗ
	|					ТаблицаДокумента КАК ТаблицаДокумента)) КАК торо_ПериодыНаработкиОРСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта,
	|	Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Объект КАК Объект,
	|	ТаблицаДокумента.Показатель КАК Показатель,
	|	ТаблицаДокумента.РаспространятьНаПодчиненных КАК РаспространятьНаПодчиненных,
	|	ТаблицаДокумента.Иерархия КАК Иерархия,
	|	Остатки.СтароеЗначение КАК СтароеЗначение,
	|	&Дата КАК ДатаРаботыПо,
	|	ВТ_Даты.ДатаРаботыС КАК ДатаРаботыС,
	|	ТаблицаДокумента.Наработка КАК Наработка
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ТаблицаДокумента.Объект = Остатки.Объект
	|			И ТаблицаДокумента.Показатель = Остатки.Показатель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Даты КАК ВТ_Даты
	|		ПО ТаблицаДокумента.Объект = ВТ_Даты.ОбъектРемонта
	|			И ТаблицаДокумента.Показатель = ВТ_Даты.Показатель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаДокумента.НомерСтроки";	
				   
	 Запрос.УстановитьПараметр("ТаблицаДокумента", ОбъектКопирования.НаработкаОбъектов.Выгрузить( , "НомерСтроки, Объект, Показатель,РаспространятьНаПодчиненных,Иерархия,Наработка"));
	 Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	 
	 НаработкаОбъектов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	 	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") 
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")
		ИЛИ ТипЗнч(Основание)=Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда	
		
		Организация			= Основание.Организация;
		Подразделение		= Основание.Подразделение;
		ДокументОснование	= Основание;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
		
		Если Основание.Свойство("ОбъектРемонта") Тогда
			НоваяСтрока = НаработкаОбъектов.Добавить();
			НоваяСтрока.ДатаРаботыПо = ТекущаяДата();
			НоваяСтрока.Показатель = Основание.Показатель;
			НоваяСтрока.Объект = Основание.ОбъектРемонта;
			НоваяСтрока.Иерархия = Основание.Иерархия;
		КонецЕсли; 

	КонецЕсли;
	
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьУправляемыеБлокировки(РежимЗаписи)
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.торо_НаработкаОбъектовРемонта");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = НаработкаОбъектов;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектРемонта","Объект");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Показатель","Показатель");
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.торо_НаработкаОбъектовРемонта");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = НаработкаПодчиненныхОбъектов;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектРемонта","Объект");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Показатель","Показатель");
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.ИсточникДанных = НаработкаПодчиненныхОбъектов;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектРемонта","Объект");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Показатель","Показатель");
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.ИсточникДанных = НаработкаОбъектов;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектРемонта","Объект");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Показатель","Показатель");
		
	КонецЕсли;
	
	ЭлементБлокировки = Блокировка.Добавить("Документ.торо_УстановкаПроизвольногоЗначенияНаработки");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ПолучитьТаблицуДокументовПроизвольногоЗначенияНаработкиДляБлокировки(Ссылка);
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка","Ссылка");
	
	Блокировка.Заблокировать();
	
КонецПроцедуры

Функция ПолучитьТаблицуДокументовПроизвольногоЗначенияНаработкиДляБлокировки(ДокОсн)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_УстановкаПроизвольногоЗначенияНаработки.Ссылка
	               |ИЗ
	               |	Документ.торо_УстановкаПроизвольногоЗначенияНаработки КАК торо_УстановкаПроизвольногоЗначенияНаработки
	               |ГДЕ
	               |	торо_УстановкаПроизвольногоЗначенияНаработки.ДокументОснование = &ДокОсн";
	Запрос.УстановитьПараметр("ДокОсн",ДокОсн);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПроверитьЦельностьНаработкиПриПроведении(Отказ)
	
	// Проверка, что при вводе данного документа не получится интервала с "незаполненным" значением наработки.
	Если НЕ Проведен Тогда
		
		УстановитьУправляемыеБлокировки(РежимЗаписиДокумента.Проведение);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаработкаОбъектов.Объект КАК Объект,
		|	НаработкаОбъектов.Показатель КАК Показатель,
		|	НаработкаОбъектов.ДатаРаботыС КАК ДатаРаботыС
		|ПОМЕСТИТЬ НаработкаОбъектов
		|ИЗ
		|	&НаработкаОбъектов КАК НаработкаОбъектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НаработкаПодчиненныхОбъектов.Объект КАК Объект,
		|	НаработкаПодчиненныхОбъектов.Показатель КАК Показатель,
		|	НаработкаПодчиненныхОбъектов.ДатаРаботыС КАК ДатаРаботыС
		|ПОМЕСТИТЬ НаработкаПодчиненныхОбъектов
		|ИЗ
		|	&НаработкаПодчиненныхОбъектов КАК НаработкаПодчиненныхОбъектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(НаработкаОбъектов.Объект КАК Справочник.торо_ОбъектыРемонта) КАК Объект,
		|	НаработкаОбъектов.Показатель КАК Показатель,
		|	НаработкаОбъектов.ДатаРаботыС КАК ДатаРаботыС
		|ПОМЕСТИТЬ торо_УчетНаработкиОборудованияНаработкаОбъектов
		|ИЗ
		|	НаработкаОбъектов КАК НаработкаОбъектов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(НаработкаПодчиненныхОбъектов.Объект КАК Справочник.торо_ОбъектыРемонта),
		|	НаработкаПодчиненныхОбъектов.Показатель,
		|	НаработкаПодчиненныхОбъектов.ДатаРаботыС
		|ИЗ
		|	НаработкаПодчиненныхОбъектов КАК НаработкаПодчиненныхОбъектов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект,
		|	Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПериодыНаработкиОРСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ПериодыНаработкиОРСрезПоследних.Показатель КАК Показатель,
		|	торо_ПериодыНаработкиОРСрезПоследних.Период КАК ДатаКон
		|ПОМЕСТИТЬ ВТ_Даты
		|ИЗ
		|	РегистрСведений.торо_ПериодыНаработкиОР.СрезПоследних(
		|			,
		|			(ОбъектРемонта, Показатель) В
		|					(ВЫБРАТЬ
		|						торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект КАК Объект,
		|						торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель
		|					ИЗ
		|						торо_УчетНаработкиОборудованияНаработкаОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов)
		|				И Регистратор <> &Ссылка) КАК торо_ПериодыНаработкиОРСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект КАК Объект,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.ДатаРаботыС КАК ДатаРаботыС,
		|	ЕСТЬNULL(ВТ_Даты.ДатаКон, торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект.ДатаВводаВЭксплуатацию) КАК ДатаКон
		|ИЗ
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Даты КАК ВТ_Даты
		|		ПО торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект = ВТ_Даты.ОбъектРемонта
		|			И торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель = ВТ_Даты.Показатель
		|ГДЕ
		|	ЕСТЬNULL(ВТ_Даты.ДатаКон, торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект.ДатаВводаВЭксплуатацию) <> торо_УчетНаработкиОборудованияНаработкаОбъектов.ДатаРаботыС";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("НаработкаОбъектов", НаработкаОбъектов);
		Запрос.УстановитьПараметр("НаработкаПодчиненныхОбъектов", НаработкаПодчиненныхОбъектов);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			ВыборкаНаработокСОшибками = РезультатЗапроса.Выбрать();
			Пока ВыборкаНаработокСОшибками.Следующий() Цикл
				Если ВыборкаНаработокСОшибками.ДатаКон = ВыборкаНаработокСОшибками.Объект.ДатаВводаВЭксплуатацию Тогда
					ШаблонСообщения = НСтр("es='Para el objeto de la reparación ""%1"" no es fijados el significado de la elaboración ""%2"", la fecha de la introducción del objeto en la explotación: ¡%3, "
"el campo ""la Fecha del trabajo con"" en el documento es rellenado incorrectamente! Comprueben la corrección del relleno del campo dado de la parte tabular del documento.';ru='Для объекта ремонта ""%1"" не зафиксировано значение наработки ""%2"", дата ввода объекта в эксплуатацию: %3,"
"поле ""Дата работы с"" в документе заполнено неверно! Проверьте корректность заполнения данного поля табличной части документа.';en='The operating time"" ""%2"" ""for the repair object"" ""%1"" ""is not fixed, the date of commissioning of the object:%3,"
"the field """" Date of work with """" in the document is filled incorrectly! Check the correctness of filling in this field of the tabular part of the document.'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаНаработокСОшибками.Объект, ВыборкаНаработокСОшибками.Показатель, ВыборкаНаработокСОшибками.ДатаКон);
				Иначе
					ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" es fijado el significado de la elaboración ""%2"", en %3, "
"el campo ""la Fecha del trabajo con"" en el documento es rellenado incorrectamente! Comprueben la corrección del relleno del campo dado de la parte tabular del documento.';ru='Для объекта ремонта ""%1"" зафиксировано значение наработки ""%2"", на %3,"
"поле ""Дата работы с"" в документе заполнено неверно! Проверьте корректность заполнения данного поля табличной части документа.';en='For the repair object"" ""%1"" ""the value of the operating time"" ""%2"" "",%3,"
"the field """" Date of work with """" in the document is filled incorrectly! Check the correctness of filling in this field of the tabular part of the document. '");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаНаработокСОшибками.Объект, ВыборкаНаработокСОшибками.Показатель, ВыборкаНаработокСОшибками.ДатаКон);
				КонецЕсли;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

Процедура ПроверитьЦельностьНаработкиПриОтменеПроведения(Отказ)

	УстановитьУправляемыеБлокировки(РежимЗаписиДокумента.ОтменаПроведения);
	
	// Проверка, что при вводе данного документа не получится интервала с "незаполненным" значением наработки.
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект КАК Объект,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.ДатаРаботыПо КАК ДатаРаботыПо
	|ПОМЕСТИТЬ НаработкаОбъектов
	|ИЗ
	|	&НаработкаОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_УчетНаработкиОборудованияНаработкаПодчиненныхОбъектов.Объект КАК Объект,
	|	торо_УчетНаработкиОборудованияНаработкаПодчиненныхОбъектов.Показатель КАК Показатель,
	|	торо_УчетНаработкиОборудованияНаработкаПодчиненныхОбъектов.ДатаРаботыПо КАК ДатаРаботыПо
	|ПОМЕСТИТЬ НаработкаПодчиненныхОбъектов
	|ИЗ
	|	&НаработкаПодчиненныхОбъектов КАК торо_УчетНаработкиОборудованияНаработкаПодчиненныхОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаработкаОбъектов.Объект КАК Объект,
	|	НаработкаОбъектов.Показатель КАК Показатель,
	|	НаработкаОбъектов.ДатаРаботыПо КАК ДатаРаботыПо
	|ПОМЕСТИТЬ торо_УчетНаработкиОборудованияНаработкаОбъектов
	|ИЗ
	|	НаработкаОбъектов КАК НаработкаОбъектов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаработкаПодчиненныхОбъектов.Объект,
	|	НаработкаПодчиненныхОбъектов.Показатель,
	|	НаработкаПодчиненныхОбъектов.ДатаРаботыПо
	|ИЗ
	|	НаработкаПодчиненныхОбъектов КАК НаработкаПодчиненныхОбъектов";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НаработкаОбъектов", НаработкаОбъектов);
	Запрос.УстановитьПараметр("НаработкаПодчиненныхОбъектов", НаработкаПодчиненныхОбъектов);
	Запрос.Выполнить();
	
	РезультатЗапроса = торо_РаботаСНаработкой.ПолучитьОбъектыРемонтаСНаработкойВБудущем(МВТ, Ссылка);
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ВыборкаНаработокСОшибками = РезультатЗапроса.Выбрать();
		Пока ВыборкаНаработокСОшибками.Следующий() Цикл
			ШаблонСообщения = НСтр("es='Para el objeto de la reparación ""%1"" es fijado el significado de la elaboración ""%2"" a una fecha más avanzada, que el documento: por %3,';ru='Для объекта ремонта ""%1"" зафиксировано значение наработки ""%2"" на более позднюю дату, чем документом: по %3,';en='For the repair object ""% 1"", the value of the operating time ""% 2"" was fixed at a later date than the document: for% 3,'") +
			Символы.ПС + Символы.Таб + 
			НСтр("es='¡La anulación de la realización del documento es imposible! Para la ejecución de las acciones con el documento anulen la realización de unos documentos más avanzados.';ru='Отмена проведения документа невозможна! Для выполнения действий с документом отмените проведение более поздних документов.';en='Canceling a document is not possible! To perform actions with the document, cancel the holding of later documents.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаНаработокСОшибками.Объект, ВыборкаНаработокСОшибками.Показатель, ВыборкаНаработокСОшибками.ДатаКон);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
